
* Relative Last week report.
Customiziation ref: 
http://orgmode.org/manual/The-clock-table.html

Ideas: tag matching.. 
options I customize:   :step day   
#+BEGIN: clocktable :tstart "<-6d>" :tend "<now>" :scope agenda-with-archives :narrow 70 :formatter my-org-clocktable-notodo :maxlevel 3 :fileskip0
#+CAPTION: Clock summary at [2015-06-10 Wed 11:52]
|           | <70>                                                                   |         |      |      |
| File      | Headline                                                               | Time    |      |      |
|-----------+------------------------------------------------------------------------+---------+------+------|
|           | ALL *Total time*                                                       | *12:30* |      |      |
|-----------+------------------------------------------------------------------------+---------+------+------|
| dev.org   | *File time*                                                            | *10:01* |      |      |
|           | DEV   (development)                                                    | 10:01   |      |      |
|           | - Bug 465984 - Double-clicking in package explorer ,,,                 |         | 5:59 |      |
|           | - Eric support.                                                        |         | 0:41 |      |
|           | - @ GWork                                                              |         | 2:21 |      |
|           | -- [#A] Weekly report                                                  |         |      | 0:25 |
|           | - DEVC (Development cancled/failed/aborted)                            |         | 1:00 |      |
|           | -- INCO Releng perf issue with Git repo                                |         |      | 1:00 |
|-----------+------------------------------------------------------------------------+---------+------+------|
| linux.org | *File time*                                                            | *2:29*  |      |      |
|           | RHCSA                                                                  | 2:29    |      |      |
|           | - 4 Filse Permissions                                                  |         | 0:37 |      |
|           | - 5 SELinux Permissions                                                |         | 1:52 |      |
#+END:

#+begin_src emacs-lisp :var clocked=clocked :results table
(cl-loop for row in (subseq clocked 4) ; skip headers
         collect (list (org-parse-time-string (nth 0 row))
                       (org-duration-string-to-minutes (nth 2 row))))
#+end_src



* Relative Last week by day
#+BEGIN: clocktable :tstart "<-1w>" :tend "<+0d>" :step day :scope ("dev.org" "linux.org" "emacs.org" "leo.org") :narrow 65 :formatter my-org-clocktable-notodo :maxlevel 2

Daily report: [2015-02-19 Thu]
|           | <65>                                                              |        |      |
| File      | Headline                                                          | Time   |      |
|-----------+-------------------------------------------------------------------+--------+------|
|           | ALL *Total time*                                                  | *3:42* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| dev.org   | *File time*                                                       | *3:08* |      |
|           | Dev                                                               | 3:08   |      |
|           | -- Configure VMs for testing [[elisp:(my/goto-parent)][parent]]                               |        | 2:23 |
|           | -- General                                                        |        | 0:45 |
|-----------+-------------------------------------------------------------------+--------+------|
| linux.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| emacs.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| leo.org   | *File time*                                                       | *0:34* |      |
|           | [#C] Emacs                                                        | 0:34   |      |
|           | -- [#B] Auto-load org files                                       |        | 0:34 |

Daily report: [2015-02-20 Fri]
|           | <65>                                                              |        |      |
| File      | Headline                                                          | Time   |      |
|-----------+-------------------------------------------------------------------+--------+------|
|           | ALL *Total time*                                                  | *3:11* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| dev.org   | *File time*                                                       | *3:11* |      |
|           | Dev                                                               | 3:11   |      |
|           | -- Configure VMs for testing [[elisp:(my/goto-parent)][parent]]                               |        | 1:06 |
|           | -- test if DND works in outline view in Mars (4.5) Build id: I20150217-0800 has outline view fixed (RHBZ#1012336). |        | 0:16 |
|           | -- General                                                        |        | 0:21 |
|           | -- Pending Indefintley                                            |        | 1:28 |
|-----------+-------------------------------------------------------------------+--------+------|
| linux.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| emacs.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| leo.org   | *File time*                                                       | *0:00* |      |

Daily report: [2015-02-21 Sat]
|      | <65>                                                              |        |
| File | Headline                                                          | Time   |
|------+-------------------------------------------------------------------+--------|
|      | ALL *Total time*                                                  | *0:00* |

Daily report: [2015-02-22 Sun]
|           | <65>                                                              |        |      |
| File      | Headline                                                          | Time   |      |
|-----------+-------------------------------------------------------------------+--------+------|
|           | ALL *Total time*                                                  | *2:55* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| dev.org   | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| linux.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| emacs.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| leo.org   | *File time*                                                       | *2:55* |      |
|           | [#C] Emacs                                                        | 0:05   |      |
|           | -- [#B] Implement pomodoro continue                               |        | 0:01 |
|           | -- Mate command to show Pomodoro time.                            |        | 0:04 |
|           | Fin                                                               | 2:50   |      |
|           | -- Figure out how to swap alt and command on my mac.              |        | 2:50 |

Daily report: [2015-02-23 Mon]
|           | <65>                                                              |        |      |
| File      | Headline                                                          | Time   |      |
|-----------+-------------------------------------------------------------------+--------+------|
|           | ALL *Total time*                                                  | *4:09* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| dev.org   | *File time*                                                       | *3:28* |      |
|           | Dev                                                               | 1:38   |      |
|           | -- General                                                        |        | 0:25 |
|           | -- Pending Indefintley                                            |        | 1:13 |
|           | Learn                                                             | 1:50   |      |
|           | -- Learn about SWT Menu                                           |        | 1:50 |
|-----------+-------------------------------------------------------------------+--------+------|
| linux.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| emacs.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| leo.org   | *File time*                                                       | *0:41* |      |
|           | Fin                                                               | 0:41   |      |
|           | -- [#B] Clear my dropbox down to a smaller size                   |        | 0:41 |

Daily report: [2015-02-24 Tue]
|           | <65>                                                              |        |      |
| File      | Headline                                                          | Time   |      |
|-----------+-------------------------------------------------------------------+--------+------|
|           | ALL *Total time*                                                  | *3:41* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| dev.org   | *File time*                                                       | *2:56* |      |
|           | Dev                                                               | 1:06   |      |
|           | -- General                                                        |        | 0:16 |
|           | -- Pending Indefintley                                            |        | 0:50 |
|           | Learn                                                             | 1:43   |      |
|           | -- Learn about GTK Menu                                           |        | 1:43 |
|           | Footnotes                                                         | 0:07   |      |
|-----------+-------------------------------------------------------------------+--------+------|
| linux.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| emacs.org | *File time*                                                       | *0:00* |      |
|-----------+-------------------------------------------------------------------+--------+------|
| leo.org   | *File time*                                                       | *0:45* |      |
|           | [#C] Emacs                                                        | 0:45   |      |
|           | -- Toc on left side for org-mode readings                         |        | 0:45 |

Daily report: [2015-02-25 Wed]
|           | <65>                                                              |         |      |
| File      | Headline                                                          | Time    |      |
|-----------+-------------------------------------------------------------------+---------+------|
|           | ALL *Total time*                                                  | *10:00* |      |
|-----------+-------------------------------------------------------------------+---------+------|
| dev.org   | *File time*                                                       | *4:30*  |      |
|           | Dev                                                               | 4:30    |      |
|           | -- Replace deprecated GtkMisk:yad                                 |         | 2:34 |
|           | -- Replace deprecated GtkCellRenderer:cell-background-gdk         |         | 0:50 |
|           | -- General                                                        |         | 0:36 |
|           | -- Pending Indefintley                                            |         | 0:30 |
|-----------+-------------------------------------------------------------------+---------+------|
| linux.org | *File time*                                                       | *0:00*  |      |
|-----------+-------------------------------------------------------------------+---------+------|
| emacs.org | *File time*                                                       | *0:00*  |      |
|-----------+-------------------------------------------------------------------+---------+------|
| leo.org   | *File time*                                                       | *5:30*  |      |
|           | [#C] Emacs                                                        | 5:30    |      |
|           | -- [#B] Figure out capture + refiling.                            |         | 1:25 |
|           | -- [#B] Babel / dynamic language (ditaa/Grahviz/plantUML) execution |         | 0:55 |
|           | -- [#A] Investigate diary logging. (find blog entry on this).     |         | 1:35 |
|           | -- [#A] Investigate diary logging. (find blog entry on this).     |         | 1:35 |
#+END:
* Last week with sorted columnsq
Not working:
#+BEGIN: columnview :id local :tstart "<-1w>" :tend "<-1d>" :scope ("dev.org" "linux.org" "emacs.org" "leo.org")  :format "%70ITEM(Task) %Effort{:} %CLOCKSUM{:} %CLOCKSUM_T{:}"  :scope ("dev.org" "linux.org" "emacs.org" "leo.org")
| Task                             | Effort | CLOCKSUM | CLOCKSUM_T |
|----------------------------------+--------+----------+------------|
| * Last week with sorted columnsq |        |          |            |
#+END:
* Clock by tag 
1) Evaluate code below
2) Evaluate table.
   Anythign with 'REP' tag is displayed. 

src: http://stackoverflow.com/questions/17353591/timetable-grouped-by-tag

#+BEGIN: clocktable-by-tag :tags ("REP") :tstart "<-6d>" :tend "<now>" :maxlevel 3

#+END:

#+begin_src emacs-lisp
  (defun clocktable-by-tag/shift-cell (n)
      (let ((str ""))
        (dotimes (i n)
          (setq str (concat str "| ")))
        str))

    (defun clocktable-by-tag/insert-tag (params)
      (let ((tag (plist-get params :tags)))
        (insert "|--\n")
        (insert (format "| %s | *Tag time* |\n" tag))
        (let ((total 0))
          (mapcar
           (lambda (file)
             (let ((clock-data (with-current-buffer (find-file-noselect file)
                                 (org-clock-get-table-data (buffer-name) params))))
               (when (> (nth 1 clock-data) 0)
                 (setq total (+ total (nth 1 clock-data)))
                 (insert (format "| | File *%s* | %.2f |\n"
                                 (file-name-nondirectory file)
                                 (/ (nth 1 clock-data) 60.0)))
                 (dolist (entry (nth 2 clock-data))
                   (insert (format "| | . %s%s | %s %.2f |\n"
                                   (org-clocktable-indent-string (nth 0 entry))
                                   (nth 1 entry)
                                   (clocktable-by-tag/shift-cell (nth 0 entry))
                                   (/ (nth 3 entry) 60.0)))))))
           (org-agenda-files))
          (save-excursion
            (re-search-backward "*Tag time*")
            (org-table-next-field)
            (org-table-blank-field)
            (insert (format "*%.2f*" (/ total 60.0)))))
        (org-table-align)))

    (defun org-dblock-write:clocktable-by-tag (params)
      (insert "| Tag | Headline | Time (h) |\n")
      (insert "|     |          | <r>  |\n")
      (let ((tags (plist-get params :tags)))
        (mapcar (lambda (tag)
                  (setq params (plist-put params :tags tag))
                  (clocktable-by-tag/insert-tag params))
                tags)))
#+end_src
* By day from Sacha
[2015-05-07 Thu 16:55]

For these to work, need to inclue sacha's function first:
http://sachachua.com/blog/2007/12/clocking-time-with-emacs-org/

#+BEGIN: rangereport :maxlevel 2 :tstart "<2015-05-04 Mon>" :tend "<2015-05-10 Sun>" :scope agenda-with-archives  :fileskip0

#+END:
